//
//class ºØ¾î»§
//{
//private:
//	const char * ºØ¾î»§ÀÇ_ÀÌ¸§;
//	int ºØ¾î»§_Å©±â;
//	int ´ÜÆÏÀÇ_¾ç;
//
//public:
//	virtual void ¹ö¸®±â();
//	void ¸Ô±â(int ¸Ô´Â¾ç);
//
//};
//
//void ºØ¾î»§::¹ö¸®±â()
//{
//	// this??
//	ºØ¾î»§_Å©±â = 0;
//	´ÜÆÏÀÇ_¾ç = 0;
//}
//void ºØ¾î»§::¸Ô±â(int ¸Ô´Â¾ç)
//{
//	ºØ¾î»§_Å©±â -= ¸Ô´Â¾ç;
//	´ÜÆÏÀÇ_¾ç -= ¸Ô´Â¾ç / 2;
//}
//
//class ¾ßÃ¼ºØ¾î»§:public ºØ¾î»§
//{
//private:
//	int ¾ßÃ¼ÀÇ_¾ç;
//
//public:
//	virtual void ¹ö¸®±â()
//	{
//
//	}
//	void ¸Ô±â(int ¸Ô´Â¾ç)
//	{
//		ºØ¾î»§_Å©±â -= ¸Ô´Â¾ç;
//		´ÜÆÏÀÇ_¾ç -= ¸Ô´Â¾ç / 2;
//		¾ßÃ¼ÀÇ_¾ç -= ¸Ô´Â¾ç / 2;
//	}
//	
//};
//
//void main()
//{
//	ºØ¾î»§ ºØ¾îA;
//	ºØ¾îA.¹ö¸®±â();
//	
//	¾ßÃ¼ºØ¾î»§ ºØ¾îB;
//	ºØ¾î»§ * ºØ¾î»§µé[10];
//	ºØ¾î»§µé[0] = &ºØ¾îA;
//	ºØ¾î»§µé[1] = &ºØ¾îB;
//	Æ÷ÀÎÅÍ[0]->¹ö¸®±â(); // ºØ¾î»§°Í
//	Æ÷ÀÎÅÍ[0]->¸Ô±â(10); // ºØ¾î»§°Í
//	Æ÷ÀÎÅÍ[1]->¹ö¸®±â(); // ¾ßÃ¼ºØ¾î»§ÀÇ ¹ö¸®±â
//	Æ÷ÀÎÅÍ[1]->¸Ô±â(10); // ºØ¾î»§ÀÇ ¸Ô±â
//}
